`timescale 1ns / 1ps
//////////////////////////////////////////////////////////////////////////////////
// Company: 
// Engineer: 
// 
// Create Date: 2021/03/05 12:03:09
// Design Name: 
// Module Name: ADC32
// Project Name: 
// Target Devices: 
// Tool Versions: 
// Description: 
// 
// Dependencies: 
// 
// Revision:
// Revision 0.01 - File Created
// Additional Comments:
// 
//////////////////////////////////////////////////////////////////////////////////

module ADC32(
    input [31:0]a,
    input [31:0]b,
    input c0, // c0 = 1, 减法
    output [32:0]s // s[32], 进位 
    );
    wire [31:0] cin;
    
adc u1(
.a0 (a[0]),
.b0 (b[0]),
.c0 (1'b0),
.s (c0), //指示加减法
.out1 (s[0]),
.c1 (cin[0])    
);
adc u2(
.a0 (a[1]),
.b0 (b[1]),
.c0 (cin[0]),
.s (c0), //指示加减法
.out1 (s[1]),
.c1 (cin[1])    
);
adc u3(
.a0 (a[2]),
.b0 (b[2]),
.c0 (cin[1]),
.s (c0), //指示加减法
.out1 (s[2]),
.c1 (cin[2])    
);
adc u4(
.a0 (a[3]),
.b0 (b[3]),
.c0 (cin[2]),
.s (c0), //指示加减法
.out1 (s[3]),
.c1 (cin[3])    
);
adc u5(
.a0 (a[4]),
.b0 (b[4]),
.c0 (cin[3]),
.s (c0), //指示加减法
.out1 (s[4]),
.c1 (cin[4])    
);
adc u6(
.a0 (a[5]),
.b0 (b[5]),
.c0 (cin[4]),
.s (c0), //指示加减法
.out1 (s[5]),
.c1 (cin[5])    
);
adc u7(
.a0 (a[6]),
.b0 (b[6]),
.c0 (cin[5]),
.s (c0), //指示加减法
.out1 (s[6]),
.c1 (cin[6])    
);
adc u8(
.a0 (a[7]),
.b0 (b[7]),
.c0 (cin[6]),
.s (c0), //指示加减法
.out1 (s[7]),
.c1 (cin[7])    
);
adc u9(
.a0 (a[8]),
.b0 (b[8]),
.c0 (cin[7]),
.s (c0), //指示加减法
.out1 (s[8]),
.c1 (cin[8])    
);
adc u10(
.a0 (a[9]),
.b0 (b[9]),
.c0 (cin[8]),
.s (c0), //指示加减法
.out1 (s[9]),
.c1 (cin[9])    
);
adc u11(
.a0 (a[10]),
.b0 (b[10]),
.c0 (cin[9]),
.s (c0), //指示加减法
.out1 (s[10]),
.c1 (cin[10])    
);
adc u12(
.a0 (a[11]),
.b0 (b[11]),
.c0 (cin[10]),
.s (c0), //指示加减法
.out1 (s[11]),
.c1 (cin[11])    
);
adc u13(
.a0 (a[12]),
.b0 (b[12]),
.c0 (cin[11]),
.s (c0), //指示加减法
.out1 (s[12]),
.c1 (cin[12])    
);
adc u14(
.a0 (a[13]),
.b0 (b[13]),
.c0 (cin[12]),
.s (c0), //指示加减法
.out1 (s[13]),
.c1 (cin[13])    
);
adc u15(
.a0 (a[14]),
.b0 (b[14]),
.c0 (cin[13]),
.s (c0), //指示加减法
.out1 (s[14]),
.c1 (cin[14])    
);
adc u16(
.a0 (a[15]),
.b0 (b[15]),
.c0 (cin[14]),
.s (c0), //指示加减法
.out1 (s[15]),
.c1 (cin[15])    
);
adc u17(
.a0 (a[16]),
.b0 (b[16]),
.c0 (cin[15]),
.s (c0), //指示加减法
.out1 (s[16]),
.c1 (cin[16])    
);
adc u18(
.a0 (a[17]),
.b0 (b[17]),
.c0 (cin[16]),
.s (c0), //指示加减法
.out1 (s[17]),
.c1 (cin[17])    
);
adc u19(
.a0 (a[18]),
.b0 (b[18]),
.c0 (cin[17]),
.s (c0), //指示加减法
.out1 (s[18]),
.c1 (cin[18])    
);
adc u20(
.a0 (a[19]),
.b0 (b[19]),
.c0 (cin[18]),
.s (c0), //指示加减法
.out1 (s[19]),
.c1 (cin[19])    
);
adc u21(
.a0 (a[20]),
.b0 (b[20]),
.c0 (cin[19]),
.s (c0), //指示加减法
.out1 (s[20]),
.c1 (cin[20])    
);
adc u22(
.a0 (a[21]),
.b0 (b[21]),
.c0 (cin[20]),
.s (c0), //指示加减法
.out1 (s[21]),
.c1 (cin[21])    
);
adc u23(
.a0 (a[22]),
.b0 (b[22]),
.c0 (cin[21]),
.s (c0), //指示加减法
.out1 (s[22]),
.c1 (cin[22])    
);
adc u24(
.a0 (a[23]),
.b0 (b[23]),
.c0 (cin[22]),
.s (c0), //指示加减法
.out1 (s[23]),
.c1 (cin[23])    
);
adc u25(
.a0 (a[24]),
.b0 (b[24]),
.c0 (cin[23]),
.s (c0), //指示加减法
.out1 (s[24]),
.c1 (cin[24])    
);
adc u26(
.a0 (a[25]),
.b0 (b[25]),
.c0 (cin[24]),
.s (c0), //指示加减法
.out1 (s[25]),
.c1 (cin[25])    
);
adc u27(
.a0 (a[26]),
.b0 (b[26]),
.c0 (cin[25]),
.s (c0), //指示加减法
.out1 (s[26]),
.c1 (cin[26])    
);
adc u28(
.a0 (a[27]),
.b0 (b[27]),
.c0 (cin[26]),
.s (c0), //指示加减法
.out1 (s[27]),
.c1 (cin[27])    
);
adc u29(
.a0 (a[28]),
.b0 (b[28]),
.c0 (cin[27]),
.s (c0), //指示加减法
.out1 (s[28]),
.c1 (cin[28])    
);
adc u30(
.a0 (a[29]),
.b0 (b[29]),
.c0 (cin[28]),
.s (c0), //指示加减法
.out1 (s[29]),
.c1 (cin[29])    
);
adc u31(
.a0 (a[30]),
.b0 (b[30]),
.c0 (cin[29]),
.s (c0), //指示加减法
.out1 (s[30]),
.c1 (cin[30])    
);
adc u32(
.a0 (a[31]),
.b0 (b[31]),
.c0 (cin[30]),
.s (c0), //指示加减法
.out1 (s[31]),
.c1 (s[32])    
);

endmodule